# Task 1
- Create a dictionary.
Pickle and unpickle the data   
- Store in JSON and read in JSON

In [6]:
#Creating a dictionary
config = {
     "loc1" : {"city" : "blr", "vals" : [10,20,30]},
     "loc2" : {"city" : "chn", "vals" : [40,50,60]}
    }

Pickle

In [14]:
#importing pickle library
import pickle
#Open a file and dumping a data in it
f1 = open("file.pkl","ab")
file_pkl=pickle.dump(config,f1)
f1.close()

In [17]:
data=pd.read_pickle("file.pkl")
data

{'loc1': {'city': 'blr', 'vals': [10, 20, 30]},
 'loc2': {'city': 'chn', 'vals': [40, 50, 60]}}

JSON

In [23]:
#importing JSON libary
import json

f2 = open("file.JSON","w")
json.dump(config,f2)
f2.close()

In [25]:
Data = pd.read_json("file.JSON")
Data

              loc1          loc2
city           blr           chn
vals  [10, 20, 30]  [40, 50, 60]

# Task 2

In [28]:
file = open("data.csv", "w")
file.write('''name,dept,salary,bonus

arun,SALES,18000,18500

john,accts,16000,10500

ravi,purch,20000,

manu,hrd,19000,?

elan,hrd,,11000

somu,Sales,12000,10500

raja,sales,?,19000

vani,sales,21000,21500

guru,HRD,15000,

kala,HRD,15000,2000

yash,accts,18500,19000

pavan,sales,21000,21500

rinu,Accts,,2000

elan,purch,15000,2000

tara,accts,18500,3230

ullas,purch,15000,2000

manav,hrd,,

amar,sales,18000,3500

giri,Accts,21000,3000''')

file.close()

In [29]:
df=pd.read_csv("data.csv")
df.head()

   name   dept salary  bonus
0  arun  SALES  18000  18500
1  john  accts  16000  10500
2  ravi  purch  20000    NaN
3  manu    hrd  19000      ?
4  elan    hrd    NaN  11000